 {
    "glossary": [
        {
            "term": "Neutral",
            "definition": "The state of play in which neither players are attacking, blocking an attack, or jumping (both characters are free to act in any way)."
        },
        {
            "term": "Interaction",
            "definition": "This refers to the state where a player has initiated an attack against the opponent. The interaction ends when the players return to neutral."
        },
        {
            "term": "Turn",
            "definition": "While it may be unintuitive at first, fighting games are turn based. During an interaction, whoever has the frame advantage (can act first), has the turn."
        },
        {
            "term": "Hitbox",
            "definition": "The zone(s) that checks for overlap with a hurtbox. If overlap occurs, the opponent is considered hit."
        },
        {
            "term": "Hurtbox",
            "definition": "The zone(s) that check for overlap with a hitbox. If your hurtbox overlaps with the opponent's hitbox, you are considered hit."
        },
        {
            "term": "Startup",
            "definition": "The amount of frames after pressing a button before a hitbox appears."
        },
        {
            "term": "Active",
            "definition": "Frames where a hitbox is in play."
        },
        {
            "term": "Counter",
            "definition": "Hit connects while the opponent is in startup or active frames of an attack."
        },
        {
            "term": "Punish Counter",
            "definition": "Hit connects while the opponent is in recovery frames of an attack."
        },
        {
            "term": "Anti Air",
            "definition": "A move used to counter a jump in attack."
        },
        {
            "term": "Air Invincibility",
            "definition": "A special type of hurtbox that only checks for grounded attacks. Very important for anti airing."
        },
        {
            "term": "Normal",
            "definition": "Attacks that are executed by a single button press."
        },
        {
            "term": "Special",
            "definition": "Attacks that are executed by a motion input, followed by a button press."
        },
        {
            "term": "Command Normal",
            "definition": "Attacks that are executed by a direction and a button. While crouching normals fit this definition, they are referred to as 'crouching normals.'"
        },
        {
            "term": "DP (Dragon Punch)",
            "definition": "Universal term for an uppercut special."
        }
    ],
    "advanced": [
        {
            "term": "Footsies",
            "definition": "An expansion on neutral where both players are trying to manage their spacing and expose a weakness in the opponent's defense, typically with a low normal."
        },
        {
            "term": "Mental Stack",
            "definition": "The number of strategies the player can focus on at one time. Focusing on a potential strategy the opponent may execute enables the player to react to it significantly easier."
        },
        {
            "term": "Conditioning",
            "definition": "Repeating a strategy so the opponent starts to assume the strategy will be used at the next viable opportunity."
        },
        {
            "term": "Mixup",
            "definition": "A situation where the offensive player has multiple attack options which require different defensive actions."
        },
        {
            "term": "50/50",
            "definition": "A common type of mixup which presents 2 offensive options that require commitment to defend against. An example of a 50/50 would be strike (block) or a command throw (jump)."
        }
    ],
    "gamePlan": {
        "title": "Pure Defensive Play (PDP)",
        "description": "Don't pay attention to health bars. The points don't matter. Don't allow your decisions to be affected by the health bars.",
        "points": [
            "While the opponent is grounded, only attack if you are guaranteed a punish counter.",
            "When the opponent jumps into your space, counter with an anti air.",
            "Throw when the opponent is in range. If you are in the corner, backthrow to get out of the corner. This eliminates the concerns of getting hit by a DI wallsplat.",
            "DI is exclusively a counter measure. Never use it offensively or on prediction.",
            "You should only move your character with the intention of getting in the correct range to anti air a jump in.",
            "Block low unless they jump or if you recognize an overhead attack.",
            "Never jump.",
            "If the opponent gains a life lead and goes full screen for the timeout, let them. Use the time to practice specials/supers. Remember: you are there for your own development, not the rank points. The points don't matter."
        ],
        "additionalInfo": [
            "While PDP will often lead to dull stalemate scenarios, the purpose is not to win. It's to build knowledge of the game's characters so you can identify punish windows, deploy the correct defensive options, and to learn how to recognize player patterns. The secondary purpose is an introduction to neutral and footsies via your anti air spacing.",
            "PDP has no way to counter zoners or grapplers.",
            "PDP is entirely about observation and reaction. No attempts to pre-empt opponent actions should be made."
        ]
    },
    "modifiers": {
        "title": "Modifiers to Game Plan",
        "points": [
            "Introduction of combos for punish counter extensions.",
            "Replacing 2HP with DP. While the input is more difficult, the introduction of aerial invincibility means you actually have more time to execute and will significantly reduce the chance of getting counter hit.",
            "Besides DP, all specials and supers will only be used mid combo.",
            "Delay tech.",
            "Parrying when the opponent does a fireball or a super (parry is to be used as a reaction block, not a pre-emptive one).",
            "Whiff punish.",
            "Use of a fast normal when the opponent tries to walk into your space (normally 2MK)."
        ],
        "additionalInfo": [
            "When you are able to use this game plan to consistently win the interactions it's intended for, while also applying the modifiers, a new game plan (with a more offensive focus) will be introduced."
        ]
    }
}

